{
  "file": "File",
  "visits": "Visits",
  "open_existing_visit": "Open Existing Visit",
  "reload_app": "Reload App",
  "quit": "Quit",
  "help": "Help",
  "tutorial": "Tutorial",
  "about": "About",
  "settings": "Settings",
  "configuration": "Configuration",
  "create new visit": "Create New Visit",
  "panorama": "Panoramas",
  "tutorial.1paragraph": "To create a new visit, open MIT3DVisit. The first screen you'll see is where you can start creating a new project. You can also click File > Visits.",
  "tutorial.2paragraph": "First, you need to enter a name for the Visit. This project name will be used as the title of your website when it's being viewed on web browsers.",
  "tutorial.3paragraph": "The next step is to specify a folder where you want to save the project files. Make sure you're working in a directory that doesn't have any empty spaces. Avoid using folders like, for example: C:\\Users\\username\\Desktop\\New folder, because it has empty spaces in \"username\" and \"New folder\".",
  "tutorial.4paragraph": "A recommended folder path for the project can be this: C:\\Users\\David\\Desktop\\NewTour.",
  "open.existing.project": "Open Existing Project",
  "tutorial.5paragraph": "If you've already worked with this software and want to open your previous project, press Ctrl+O to browse for it on your computer. Navigate to the project's main folder and click Open. If you have the WTMProject.wtm file in the folder, the project will be listed in the Recent Projects list.",
  "tutorial.6paragraph": "Once your project is listed in Recent Projects, you can click on the title to open it.",
  "remove.project": "Remove a project from the Recent Projects list",
  "tutorial.7paragraph": "You can't delete a project from MIT3DVisit. However, you can navigate to its location by clicking on \"Show in Explorer\" and then delete the files manually, and finally click the red \"Remove from List\" button to remove it from the list.",
  "working.project": "Working with Project Preview",
  "tutorial.8paragraph": "By clicking on the project title, you'll see the Project Preview",
  "tutorial.9paragraph": "The project preview has three main parts, the top part that has the Back button on the left and the Run button on the right. In between, you can see the Project Title. You can click on it and rename the Title of your Project and it will be automatically saved after a few seconds. Below the Project Title, you can see the current project directory path. You can click on it to reveal it in the Explorer window.",
  "tutorial.10paragraph": "In the left part of the main area in the Project Preview, there are tabs: Panoramas, Hotspots, Image Resources, Video Files, Audio Files, PDF Documents, and Settings. If you click on one of them, you'll see its content on the right.",
  "tutorial.11paragraph": "Here you can add any panorama image to your project. Click the plus button to import a file. You can import a normal equirectangular panorama image.",
  "tutorial.12paragraph": "Each panorama file works as a scene within your project. That's why you can't import the same panorama file twice, otherwise the MIT3DVisit will rename it after importing.",
  "tutorial.13paragraph": "Any imported panorama image file will be listed with a square box and a preview of the image. Each box has a few buttons. At the top left of each thumbnail, you can see the name of the panorama file. If it is marked in green, it means that the panorama is the main panorama that will be loaded the first time you run the tour. To make other panoramas the main panorama, click on the title and it will turn green.",
  "tutorial.14paragraph": "In the bottom right corner of each panorama thumbnail, there are Preview and Delete buttons. You can click on the Preview button to see your full panorama image, or on the Delete button to remove it from your project. However, you cannot delete your main panorama file, as at least one panorama is required to be there. Be careful when deleting files, make sure you are not using them in your project.",
  "hotspots": "Hotspots",
  "tutorial.15paragraph": "A hotspot is a clickable element that can be placed anywhere in your 360-degree scene.",
  "tutorial.16paragraph": "For each panorama that you have in your project, you can add hotspots.",
  "tutorial.17paragraph": "To add a hotspot, click on the Add New Hotspot button. Then, a new window will appear for you to view your 360-degree scene. Press the Ctrl button while clicking on an area where you want to add the hotspot. Then, a popup window will appear. You can give it a name so that your hotspots are more organized. Then, click Add. Your new hotspot has been added.",
  "tutorial.18paragraph": "You can change the icon of your hotspot by clicking on the current icon within the hotspot boxes. There are some pre-made icons available to use. Unfortunately, currently there is no option to use your own custom image as an icon. Maybe in future versions.",
  "tutorial.19paragraph": "Your new hotspot still has no action. This means that nothing will happen if you click on the hotspot when you run your project. To add an action, click on the Add Action button on your hotspot. Then, you will see 7 hotspot action options, each of which will perform a specific task.",
  "add.image": "Adding Images, Videos, Audios, and PDF Documents",
  "tutorial.20paragraph": "After Panoramas and Hotspots, the next tabs are Images, Videos, Audios, and PDF Documents. Click on any of them and you will see an add button to add your files.",
  "tutorial.21paragraph": "Remember that the files supported by MIT3DVisit are currently limited to: jpg, jpeg, and png for images, mp4 for videos, mp3 for audios, and PDF files.",
  "tutorial.configuration": "Configuration",
  "tutorial.22paragraph": "On this page, you can configure the settings of your project according to your need. There are some settings available, such as Project Description, Panorama Loading Text, Main Panorama to load the first time, and enabling or disabling the Panolens Control Buttons at the bottom right of your virtual tour.",
  "publish": "Publish",
  "tutorial.23paragraph": "After finishing your project, at least you must build and run the project once so that your project files are generated correctly. After that, navigate to the project directory, copy all the files, and upload them to your site. That's it.",
  "tutorial.24paragraph": "For more information, contact:",
  "geral": "General",
  "projectpath": "Project Path:",
  "appearance": "Appearance",
  "language": "Language",
  "portuguese": "Portuguese",
  "english": "English",
  "darkmode": "Dark",
  "lightmode": "Light",
  "savebuttonconfig": "Save",
  "selectpath": "Select Path",
  "visitname": "Visit Name",
  "createvisit": "Create Your Virtual Visit",
  "create": "Create",
  "recentvisit": "Recent Visits",
  "panoramas": "Panoramas",
  "imageassets": "Images",
  "videos": "Videos",
  "audios": "Audio",
  "pdfs": "PDF",
  "configUpdateSuccess": "Configuration updated successfully!",
  "configUpdateError": "Error updating configuration file.",
  "selectpath.title": "Select project path",
  "alertOpenVisitTitle": "Open Visit",
  "alertInvalidVisitMessage": "This Visit is NOT valid.",
  "confirm_remove_project": "Are you sure you want to remove this project from the projects list? You will need to manually remove the directory to completely delete it from your computer.",
  "are_you_sure": "Are you sure?",
  "update_success": "Configuration updated successfully!",
  "update_error": "Error updating configuration file.",
  "select_project_path": "Select project path",
  "open_visit": "Open Visit",
  "open_visit_invalid": "This Visit is NOT valid.",
  "open_visit_exist": "This Visit already exists.",
  "invalid_name": "Invalid Name",
  "visit_already_exists": "A visit with this name already exists. Choose a new name.",
  "loading_message": "Please wait...",
  "new_visit_title": "New Virtual Visit",
  "loading_text": "Loading...",
  "show_in_explorer": "Show in Explorer",
  "remove_from_list": "Remove from List",
  "delete_project": "Delete Visit",
  "confirm_delete": "Are you sure?",
  "delete_project_warning": "Remove this project from the projects list and delete its folder? This action is irreversible.",
  "error": "Error",
  "delete_project_error": "Could not delete project folder.",
  "whitespace_problem": "Whitespace Problem",
  "whitespace_problem_msg": "This project folder contains whitespace. Please explore and locate it manually on your computer:",
  "about_title": "About",
  "version": "Version",
  "built_with": "Built with",
  "developed_by": "Developed by",
  "corrupted_project": "Corrupted Project",
  "corrupted_project_msg": "We apologize, but we cannot open this project.",
  "panoramic_images": "Panoramic Images",
  "main_pano_alert_message": "This panorama is already set as the Main Panorama.",
  "main_pano_alert_title": "Main Panorama",
  "project_description": "Project Description",
  "short_description": "Short description",
  "loading_text_load": "Loading Text",
  "loading_text_placeholder": "Loading Text...",
  "first_panorama": "First Panorama",
  "viewer_settings": "Viewer Settings",
  "no": "No",
  "yes": "Yes",
  "save": "Save",
  "images": "Images",
  "add_new_file": "Add New File",
  "pdf_documents": "PDF Documents",
  "chooseAction": "Choose action",
  "openPanorama": "Open Panorama",
  "showImage": "Show Image",
  "playVideo": "Play Video",
  "playAudio": "Play Audio",
  "openPdfFile": "Open PDF File",
  "openUrl": "Open URL",
  "executeJavaScript": "Execute JavaScript code",
  "close": "Close",
  "openPanoramaDestiny": "Destination Panorama:",
  "choose": "Click to choose...",
  "openImage": "Image to open:",
  "hotspotIconLabel": "Current Hotspot Icon",
  "clickToChangeLabel": "(Click to change):",
  "showTitleOnHoverLabel": "Show title on hover",
  "noLabel": "No",
  "yesLabel": "Yes",
  "currentHotspotLocationLabel": "Current Hotspot Location",
  "saveButtonLabel": "Save",
  "closeButtonLabel": "Close",
  "panoramaDestination": "Choose Destination Panorama",
  "chooseImage": "Choose an Image",
  "chooseVideo": "Choose a Video",
  "chooseAudio": "Choose an Audio",
  "choosePdf": "Choose a PDF",
  "actionAdded": "Action added",
  "removeHotspot": "Remove Hotspot",
  "confirmRemoveHotspot": "Are you sure you want to remove this hotspot?",
  "addImageasset": "Add Image",
  "removeImageasset": "Remove Image",
  "addVideofile": "Add Video",
  "removeVideofile": "Remove Video",
  "waitMessage": "Please wait...",
  "addNewFile": "Add new file...",
  "deleteFileMessage": "Deleting file. Please wait...",
  "homePanoramaSetMessage": "The new start panorama has been set to: ",
  "projectSettingsTitle": "Project Settings",
  "settingsUpdatedMessage": "The settings have been updated successfully.",
  "pleaseWait": "Please wait...",
  "removePanoramaTitle": "Remove Panorama",
  "removePanoramaMessage": "Do you want to remove this panorama? All hotspots within it will also be lost.",
  "unableToRemoveTitle": "Unable to remove",
  "unableToRemoveMessage": "This panorama has been set as the main panorama. It cannot be removed unless you set another panorama file as the main panorama.",
  "projectTitle": "Project Title",
  "projectTitleUpdated": "New project title has been updated.",
  "noHotspotForPanoramaMessage": "There are no hotspots for this panorama.",
  "noAction": "This hotspot does not have any action yet. Click the Add button to add an action.",
  "title": "Actions:",
  "playVideoFile": "Play Video",
  "playAudioFile": "Play Audio",
  "showPDFFile": "Show PDF",
  "hotspot": "Add New Hotspot",
  "messagespot": "Press Ctrl + Click where you want to place a hotspot.",
  "wait": "Please wait...",
  "panoramic-image": "Panoramic Image",
  "add-hotspot-button": "Add New Hotspot",
  "no-hotspot-action": "This hotspot has no action yet. Click the add button (+) to insert an action.",
  "action": "Action",
  "del": "Delete",
  "chooseopt": "Choose an option...",
  "noproject": "Project not found.",
  "projectpathexport": "Path to export:",
  "selectpathexport": "Select export path",
  "export_sucess": "Exported successfully.",
  "export": "Export",
  "titlehotspot": "New hotspot",
  "add": "Add",
  "cancel": "Cancel",
  "nameLabel": "Hotspot name",
  "placeholder": "Hotspot name",
  "addHotspotControl": "CTRL+Click to add a new hotspot",
  "attention": "Attention",
  "definePanorama": "You need to set a main panorama before starting the project preview.",
  "building":"Building..."
}
