{
  "file": "Ficheiro",
  "visits": "Visitas",
  "open_existing_visit": "Abrir Visita existente",
  "reload_app": "Recarregar a Aplicação",
  "quit": "Sair",
  "help": "Ajuda",
  "tutorial": "Tutorial",
  "about": "Acerca",
  "settings": "Configurações",
  "configuration": "Configuração",
  "create new visit": "Criar uma nova Visita",
  "panorama": "Panoramas",
  "tutorial.1paragraph": "Para criar uma nova visita, abra o MIT3DVisit. A primeira tela que irá ver é onde pode começar a criar um novo projeto. Também pode clicar em Ficheiro > Visitas.",
  "tutorial.2paragraph": "Em primeiro lugar, é necessário introduzir um nome para a Visita. Este nome do projeto será usado como título do seu website quando estiver a ser visualizado em navegadores web.",
  "tutorial.3paragraph": "O próximo passo é especificar uma pasta onde deseja guardar os ficheiros do projeto. Certifique-se de que está a trabalhar num diretório que não tem espaços vazios. Evite usar pastas como, por exemplo: C:\\Utilizadores\\nome de utilizador\\Desktop\\Nova pasta, porque tem espaços vazios em \"nome de utilizador\" e \"Nova pasta\".",
  "tutorial.4paragraph": "Um caminho de pasta recomendado para o projeto pode ser este: C:\\Utilizadores\\David\\Desktop\\NovoTour.",
  "open.existing.project": "Abrir Projeto Existente",
  "tutorial.5paragraph": "Se já trabalhou com este software e deseja abrir o seu projeto anterior, pressione Ctrl+O para procurá-lo no seu computador. Navegue até à pasta principal do projeto e clique em Abrir. Se tivero ficheiro WTMProject.wtm na pasta, o projeto será listado na lista de Projetos Recentes.",
  "tutorial.6paragraph": "Assim que o seu projeto estiver listado em Projetos Recentes, pode clicar no título para abri-lo.",
  "remove.project": "Remover um projeto da lista de Projetos Recentes",
  "tutorial.7paragraph": "     Não pode apagar um projeto do MIT3DVisit. No entanto, pode navegar até à sua localização clicando em \"Mostrar no Explorador\" e, em seguida, eliminar os ficheiros manualmente e, por fim, clicar no botão vermelho \"Remover da Lista\" para removê-lo da lista.",
  "working.project": "Trabalhando com a Visualização do Projeto",
  "tutorial.8paragraph": "Ao clicar no título do projeto, verá a Visualização do Projeto",
  "tutorial.9paragraph": "A visualização do projeto tem três partes principais, a parte superior que tem o botão Voltar à esquerda e o botão Executar à direita. Entre eles, pode ver o Título do Projeto. Pode clicar nele e renomear o Título do seu Projeto e, automaticamente, ele será salvo após alguns segundos. Abaixo do Título do Projeto, pode ver o caminho do diretório do projeto atual. Pode clicar nele para revelá-lo na janela do Explorador.",
  "tutorial.10paragraph": "Na parte esquerda da área principal na Visualização do Projeto, existem separadores: Panoramas, Hotspots, Recursos de Imagem, Arquivos de Vídeo, Arquivos de Áudio, Documentos PDF e Configurações. Se clicar em um deles, verá seu conteúdo à direita.",
  "tutorial.11paragraph": "Aqui pode adicionar qualquer imagem de panorama ao seu projeto. Clique no botão mais para importar um ficheiro. Pode importar uma imagem de panorama equiretangular normal.",
  "tutorial.12paragraph": " Cada ficheiro de panorama funciona como uma cena dentro do seu projeto. É por isso que não pode importar o mesmo ficheiro de panorama duas vezes, caso contrário o MIT3DVisit irá renomeá-lo após a importação.",
  "tutorial.13paragraph": "Qualquer ficheiro de imagem de panorama importado será listado com uma caixa quadrada e uma pré-visualização da imagem. Cada caixa tem alguns botões. Na parte superior esquerda de cada miniatura, pode ver o nome do ficheiro de panorama. Se estiver marcado a verde, significa que o panorama é o panorama principal que será carregado na primeira vez que executar o tour. Para tornar outros panoramas como panorama principal, clique no título e este ficará verde.",
  "tutorial.14paragraph": "No canto inferior direito de cada miniatura de panorama, existem botões de Visualização e Eliminação. Pode clicar no botão Visualização para ver a sua imagem de panorama completa, ou no botão Eliminação para removê-lo do seu projeto. No entanto, não pode eliminar o seu ficheiro de panorama principal, pois é necessário pelo menos um panorama para estar lá. Tenha cuidado ao eliminar ficheiros, certifique-se de que não os está a usar no seu projeto.",
  "hotspots": "Hotspots",
  "tutorial.15paragraph": "Um hotspot é um elemento clicável que pode ser colocado em qualquer lugar na sua cena de 360 graus.",
  "tutorial.16paragraph": "Para cada panorama que tem no seu projeto, você pode adicionar hotspots.",
  "tutorial.17paragraph": "Para adicionar um hotspot, clique no botão Adicionar Novo Hotspot. Em seguida, aparecerá uma nova janela para que você possa visualizar a sua cena de 360 graus. Pressione o botão Ctrl enquanto clica em uma área onde deseja adicionar o hotspot. Em seguida, aparecerá uma janela popup. Você pode dar um nome a ele para que seus hotspots fiquem mais organizados. Em seguida, clique em Adicionar. Seu novo hotspot foi adicionado.",
  "tutorial.18paragraph": "Você pode mudar o ícone do seu hotspot clicando no ícone atual dentro das caixas de hotspot. Há alguns ícones pré-fabricados disponíveis para usar. Infelizmente, atualmente não há possibilidade de usar sua própria imagem personalizada como ícone. Talvez em futuras versões.",
  "tutorial.19paragraph": "Seu novo hotspot ainda não tem nenhuma ação. Isso significa que nada acontecerá se você clicar no hotspot quando executar seu projeto. Para adicionar uma ação, clique no botão Adicionar Ação no seu hotspot. Em seguida, você verá 7 opções de ação de hotspot, cada uma fará uma tarefa específica.",
  "add.image": "Adicionando imagens, vídeos, áudios e documentos PDF",
  "tutorial.20paragraph": "Depois de Panoramas e Hotspots, as próximas guias são Imagens,Vídeos, Áudios e Documentos PDF. Clique em qualquer uma delas e verá um botão de adição para adicionar seus arquivos.",
  "tutorial.21paragraph": "Lembre-se de que os arquivos suportados pelo MIT3DVisit atualmente estão limitados a: jpg, jpeg e png para imagens, mp4 para vídeos, mp3 para áudios e arquivos PDF.",
  "tutorial.configuration": "Configurações",
  "tutorial.22paragraph": "Nesta página, você pode configurar as configurações do seu projeto de acordo com sua necessidade. Existem algumas configurações disponíveis, como Descrição do Projeto, Texto de Carregamento do Panorama, Panorama Principal para carregar na primeira vez e habilitar ou desabilitar os Botões de Controle do Panolens na parte inferior direita do seu tour virtual.",
  "publish": "Publicação",
  "tutorial.23paragraph": "Depois de terminar o seu projeto, pelo menos você deve construir e executar o projeto uma vez para que seus arquivos de projeto sejam gerados corretamente. Depois disso, navegue até o diretório do projeto, copie todos os arquivos e faça upload deles para o seu site. Pronto! Isso é tudo.",
  "tutorial.24paragraph": "Para mais informações contacte :",
  "geral": "Geral",
  "projectpath": "Caminho do Projeto:",
  "appearance": "Aparência",
  "language": "Idioma",
  "portuguese": "Português",
  "english": "Inglês",
  "darkmode": "Escuro",
  "lightmode": "Claro",
  "savebuttonconfig": "Guardar",
  "selectpath": "Selecionar o Caminho",
  "visitname": "Nome da Visita",
  "createvisit": " Crie a sua Visita Virtual",
  "create": "Criar",
  "recentvisit": "Visitas Recentes",
  "panoramas": "Panoramas",
  "imageassets": "Imagens",
  "audios": "Audio",
  "pdfs": "PDF",
  "configUpdateSuccess": "Configuração atualizada com sucesso!",
  "configUpdateError": "Erro ao atualizar o arquivo de configuração.",
  "selectpath.title": "Selecione o caminho do projeto",
  "alertOpenVisitTitle": "Abrir Visita",
  "alertInvalidVisitMessage": "Esta Visita NÃO é valida.",
  "confirm_remove_project": "Tem certeza que deseja remover este projeto da lista de projetos? Você precisará remover o diretório manualmente para excluí-lo completamente do computador.",
  "are_you_sure": "Tem certeza?",
  "update_success": "Configuração atualizada com sucesso!",
  "update_error": "Erro ao atualizar o arquivo de configuração.",
  "select_project_path": "Selecione o caminho do projeto",
  "open_visit": "Abrir Visita",
  "open_visit_invalid": "Esta Visita NÃO é valida.",
  "open_visit_exist": "Esta Visita já existe.",
  "invalid_name": "Nome Inválido",
  "visit_already_exists": "Já existe uma visita com este nome. Escolha um novo nome.",
  "loading_message": "Por favor aguarde ...",
  "new_visit_title": "Nova Visita Virtual",
  "loading_text": "Aguarde...",
  "show_in_explorer": "Mostrar no Explorador",
  "remove_from_list": "Remover da Lista",
  "delete_project": "Remover Visita",
  "confirm_delete": "Tem a certeza?",
  "delete_project_warning": "Remover este projeto da lista de projetos e excluir sua pasta? Esta ação é irreversível.",
  "error": "Erro",
  "delete_project_error": "Não foi possível excluir a pasta do projeto.",
  "whitespace_problem": "Problema de espaço em branco",
  "whitespace_problem_msg": "Esta pasta de projeto contém espaço(s) em branco. Explore manualmente e localize-o no seu computador:",
  "about_title": "Sobre",
  "version": "Versão",
  "built_with": "Construído com",
  "developed_by": "Desenvolvido por",
  "corrupted_project": "Projeto Corrompido",
  "corrupted_project_msg": "Pedimos desculpa, mas não é possível abrir este projeto.",
  "panoramic_images": "Imagens Panorâmicas",
  "main_pano_alert_message": "Este panorama já está definido como o Panorama Principal.",
  "main_pano_alert_title": "Panorama Principal",
  "project_description": "Descrição de Projeto",
  "short_description": "Short description",
  "loading_text_load": "Texto de Carregamento",
  "loading_text_placeholder": "Texto de Loading...",
  "first_panorama": "Primeiro Panorama",
  "viewer_settings": "Definições de Visualizador",
  "no": "Não",
  "yes": "Sim",
  "save": "Guardar",
  "images": "Imagens",
  "videos": "Vídeos",
  "add_new_file": "Adicionar Novo Ficheiro",
  "pdf_documents": "Documentos PDF",
  "chooseAction": "Selecionar ação",
  "openPanorama": "Abrir Panorama",
  "showImage": "Mostrar Imagem",
  "playVideo": "Reproduzir Vídeo",
  "playAudio": "Reproduzir Áudio",
  "openPdfFile": "Abrir Ficheiro PDF",
  "openUrl": "Abrir URL",
  "executeJavaScript": "Executar código JavaScript",
  "close": "Fechar",
  "openPanoramaDestiny": "Panorama Destino:",
  "choose": "Clique para escolher...",
  "openImage": "Imagem a abrir:",
  "hotspotIconLabel": "Icone de Hotspot atual",
  "clickToChangeLabel": "(Click para alterar):",
  "showTitleOnHoverLabel": "Mostrar titulo ao passar por cima",
  "noLabel": "Não",
  "yesLabel": "Sim",
  "currentHotspotLocationLabel": "Localização de HotSpot atual",
  "saveButtonLabel": "Guardar",
  "closeButtonLabel": "Fechar",
  "panoramaDestination": "Choose Destination Panorama",
  "chooseImage": "Escolha uma Imagem",
  "chooseVideo": "Escolha um Vídeo",
  "chooseAudio": "Escolha um Áudio",
  "choosePdf": "Escolha um PDF",
  "actionAdded": "Ação adicionada",
  "removeHotspot": "Remover Hotspot",
  "confirmRemoveHotspot": "Tem certeza de que deseja remover este Hotspot?",
  "addImageasset": "Adicionar imagem",
  "removeImageasset": "Remover imagem",
  "addVideofile": "Adicionar vídeo",
  "removeVideofile": "Remover vídeo",
  "waitMessage": "Por favor aguarde...",
  "addNewFile": "Adicionar novo ficheiro...",
  "deleteFileMessage": "Apagar o Ficheiro. Por favor aguarde...",
  "homePanoramaSetMessage": "O novo panorama de início foi definido como: ",
  "projectSettingsTitle": "Definições de Projeto",
  "settingsUpdatedMessage": "As definições foram atualizadas com sucesso.",
  "pleaseWait": "Por favor aguarde...",
  "removePanoramaTitle": "Remover Panorama",
  "removePanoramaMessage": "Você deseja remover este panorama? Todos os hotspots dentro dele também serão perdidos.",
  "unableToRemoveTitle": "Não é possível remover",
  "unableToRemoveMessage": "Este panorama foi definido como o panorama principal. Não é possível removê-lo a menos que você defina outro arquivo de panorama como o panorama principal.",
  "projectTitle": "Título do projeto",
  "projectTitleUpdated": "Novo título do projeto foi atualizado.",
  "noHotspotForPanoramaMessage": "Não há hotspots para este panorama.",
  "noAction": "Este Hotspot ainda não tem nenhuma ação. Clique no botão Adicionar para adicionar uma ação.",
  "title": "Ações:",
  "playVideoFile": "Reproduzir vídeo",
  "playAudioFile": "Reproduzir áudio",
  "showPDFFile": "Mostrar PDF",
  "hotspot": "Adicionar Novo Hotspot",
  "messagespot": "Carregue Ctrl + Click na aréa onde deseja colocar um Hotspot.",
  "wait": "Por favor aguarde...",
  "panoramic-image": "Imagem Panorâmica",
  "add-hotspot-button": "Adicionar Novo Hotspot",
  "no-hotspot-action": "Este hotspot ainda não tem ação. Clique no botão de adicionar (+) para inserir uma ação.",
  "action": "Ação",
  "del": "Apagar",
  "chooseopt": "Escolha um...",
  "noproject": "Projeto não encontrado.",
  "projectpathexport": "Caminho para exportar:",
  "selectpathexport": "Selecionar o caminho de exportação",
  "export_sucess": "Exportado com sucesso.",
  "export": "Exportar",
  "titlehotspot": "Novo hotspot",
  "add": "Adicionar",
  "cancel": "Cancelar",
  "nameLabel": "Nome do hotspot",
  "placeholder": "Nome do hotspot",
  "addHotspotControl": "CTRL+Clique Para adicionar um novo hotspot",
  "attention": "Atenção",
  "definePanorama":"Você precisa definir um panorama principal antes de iniciar a visualização do projeto.",
  "building":"A gerar visita..."
}
